{
    "profilePicture": "profile.png",
    "fullName": "Sobhan Fooladi Mahani",
    "title": "Python Developer | AI",
    "contact": {
        "email": "sobhan.fld@outlook.com",
        "address": "Spain, Barcelona, Carrer de Valencia 443",
        "phone": "+34 661062800",
        "dob": "May 5, 1996",
        "linkedin": "https://www.linkedin.com/in/sobhan-fooladi-71b407232/"
    },
    "objective": [
        "A skilled Python Developer with expertise in AI-driven technologies, signal processing, and scalable software development. Experienced in creating high-quality APIs and implementing machine learning models for real-world applications.",
        "Contributed to innovative R&D projects like MAXSENS in Barcelona, Spain, which earned the Second Prize in IoT Solutions 2024 and was recognized as the Best Startup in the Health Industry. Focused on EMG signal processing classification and optimizing performance in cutting-edge AI applications.",
        "Currently pursuing a part-time Master’s in Telecommunications, expanding expertise in advanced computing and AI. Passionate about leveraging technology to drive impactful solutions and innovation."
    ],
    "experience": [
        {
            "position": "Backend Developer at Imaz Tech",
            "location": "Barcelona, Spain",
            "period": "Jul 2023 - Present",
            "responsibilities": [
                "Built and maintained Flask-based APIs for ML and microservices.",
                "Improved application performance through refactoring and indexing.",
                "Collaborated with front-end teams on responsive applications.",
                "Conducted testing and debugging to ensure reliability.",
                "Worked on MAXSENS, an R&D project focusing on EMG signal processing."
            ]
        },
        {
            "position": "Software Engineer at SaminCoin",
            "location": "Karaj, Iran",
            "period": "Oct 2021 - Jan 2023",
            "responsibilities": [
                "Developed backend systems with Python and Django.",
                "Designed RESTful APIs for various applications.",
                "Troubleshot and optimized code with cross-functional teams.",
                "Used Git for version control and reviewed team code.",
                "Created UML models and collaborated with UI/UX teams."
            ]
        }
    ],
    "education": [
        "Bachelor's in Information Technology, Azad University of Karaj - Sep 2015 - Aug 2020",
        "Master's in Telecommunications (MATT)(Part-time), UPC - Feb 2023 - Present"
    ],
    "skills": [
        "Programming: Python, Flask, Django, JavaScript, HTML, C#",
        "Technologies: Docker, Git, Machine Vision, MediaPipe",
        "AI: Machine Learning, Deep Learning, Signal Processing",
        "Other: Document Workflow, Scenario Modeling"
    ],
    "languages": [
        "English: Advanced, IELTS",
        "Spanish: Beginner",
        "Farsi: Native Language"
    ],
    "translations": {
        "contact": "Contact Information",
        "objective": "Professional Summary",
        "experience": "Experience",
        "education": "Education",
        "skills": "Skills",
        "languages": "Languages"
    }
}