{
    "profilePicture": "profile.png",
    "fullName": "Sobhan Fooladi Mahani",
    "title": "Python Developer | AI",
    "contact": {
        "email": "sobhan.fld@outlook.com",
        "address": "Spain, Barcelona, Carrer de Valencia 443",
        "phone": "+34 661062800",
        "dob": "May 5, 1996",
        "linkedin": "https://www.linkedin.com/in/sobhan-fooladi-71b407232/"
    },
    "objective": [
        "A highly skilled Python Developer with a strong foundation in Information Technology and extensive experience in developing and maintaining complex software solutions. Notable achievements include creating solutions for EMG signal processing classification, designing advanced logic and algorithms for diverse projects, and contributing to AI-driven services for impactful applications like MAXSENS.",
        "With a proven track record in delivering scalable, high-quality APIs and managing intricate IT projects, I bridge the gap between technical challenges and business objectives. My expertise extends to implementing machine learning models and deploying innovative AI solutions tailored to meet specific user and business needs.",
        "Passionate about leveraging technology to solve real-world problems, I thrive in dynamic environments where creativity and precision are key to success. My commitment to excellence ensures that all solutions exceed expectations while driving value and innovation."
    ],
    "experience": [
        {
            "position": "Backend Developer at Imaz Tech",
            "location": "Barcelona, Spain",
            "period": "Jul 2023 - Present",
            "responsibilities": [
                "Developed and maintained backend services and APIs using Flask for ML services and microservices.",
                "Optimized application performance through code refactoring and database indexing.",
                "Collaborated with front-end developers to create responsive and interactive web applications.",
                "Performed unit testing and debugging to ensure code reliability and scalability.",
                "Led a team of developers in an Agile environment to deliver projects on time and within budget."
            ]
        },
        {
            "position": "Software Engineer at SaminCoin",
            "location": "Karaj, Iran",
            "period": "Oct 2021 - Jan 2023",
            "responsibilities": [
                "Developed and maintained backend systems using Python and Django.",
                "Designed and implemented RESTful APIs for various projects.",
                "Collaborated with a team of developers to troubleshoot and optimize code.",
                "Utilized version control systems such as Git for code management.",
                "Performed code reviews and provided constructive feedback to peers.",
                "Contributed to the architecture and design of new software features.",
                "Developed scenario models using UML for new features and collaborated with the UI/UX team."
            ]
        }
    ],
    "education": [
        "Bachelor's in Information Technology, Azad University of Karaj - Sep 2015 - Aug 2020",
        "Master's in Telecommunications (MATT), UPC - Feb 2023 - Present"
    ],
    "skills": [
        "Programming: Python, Flask, Django",
        "Technologies: Docker, Git, Machine Vision",
        "AI: Machine Learning, Deep Learning",
        "Other: Document Workflow, Scenario Modeling"
    ],
    "languages": [
        "English: Advanced, IELTS\nSpanish: Beginner\nFarsi: Native Language\n"
    ],
    "translations": {
        "contact": "Contact Information",
        "objective": "Professional Summary",
        "experience": "Experience",
        "education": "Education",
        "skills": "Skills",
        "languages": "Languages"
    }
}
