{
    "profilePicture": "profile.png",
    "fullName": "Sobhan Fooladi Mahani",
    "title": "Desarrollador Python | IA",
    "contact": {
        "email": "sobhan.fld@outlook.com",
        "address": "España, Barcelona, Carrer de Valencia 443",
        "phone": "+34 661062800",
        "dob": "5 de mayo de 1996",
        "linkedin": "https://www.linkedin.com/in/sobhan-fooladi-71b407232/"
    },
    "objective": [
        "Desarrollador Python altamente cualificado con una sólida base en Tecnología de la Información y amplia experiencia en el desarrollo y mantenimiento de soluciones de software complejas. Logros destacados incluyen la creación de soluciones para la clasificación de señales EMG, el diseño de lógica avanzada y algoritmos para diversos proyectos, y la contribución a servicios impulsados por IA para aplicaciones innovadoras como MAXSENS.",
        "Con un historial probado en la entrega de API escalables y de alta calidad y en la gestión de proyectos de TI complejos, conecto los desafíos técnicos con los objetivos empresariales. Mi experiencia abarca la implementación de modelos de aprendizaje automático y el despliegue de soluciones de IA innovadoras adaptadas a las necesidades específicas de usuarios y negocios.",
        "Apasionado por aprovechar la tecnología para resolver problemas del mundo real, prospero en entornos dinámicos donde la creatividad y la precisión son clave para el éxito. Mi compromiso con la excelencia garantiza que todas las soluciones superen las expectativas y generen valor e innovación."
    ],
    "experience": [
        {
            "position": "Desarrollador Backend en Imaz Tech",
            "location": "Barcelona, España",
            "period": "Jul 2023 - Presente",
            "responsibilities": [
                "Desarrollo y mantenimiento de servicios backend y APIs usando Flask para servicios de ML y microservicios.",
                "Optimización del rendimiento de la aplicación mediante la refactorización del código y la indexación de la base de datos.",
                "Colaboración con desarrolladores front-end para crear aplicaciones web interactivas y responsivas.",
                "Realización de pruebas unitarias y depuración para asegurar la fiabilidad y escalabilidad del código.",
                "Liderazgo de un equipo de desarrolladores en un entorno Ágil para entregar proyectos a tiempo y dentro del presupuesto."
            ]
        },
        {
            "position": "Ingeniero de Software en SaminCoin",
            "location": "Karaj, Irán",
            "period": "Oct 2021 - Ene 2023",
            "responsibilities": [
                "Desarrollo y mantenimiento de sistemas backend usando Python y Django.",
                "Diseño e implementación de APIs RESTful para varios proyectos.",
                "Colaboración con un equipo de desarrolladores para solucionar problemas y optimizar el código.",
                "Utilización de sistemas de control de versiones como Git para la gestión del código.",
                "Realización de revisiones de código y proporcionar retroalimentación constructiva a los compañeros.",
                "Contribución a la arquitectura y diseño de nuevas características de software.",
                "Desarrollo de modelos de escenarios usando UML para nuevas características y colaboración con el equipo de UI/UX."
            ]
        }
    ],
    "education": [
        "Licenciatura en Tecnología de la Información, Universidad Azad de Karaj - Sep 2015 - Ago 2020",
        "Maestría en Telecomunicaciones (MATT), UPC - Feb 2023 - Presente"
    ],
    "skills": [
        "Programación: Python, Flask, Django",
        "Tecnologías: Docker, Git, Visión Artificial",
        "IA: Aprendizaje Automático, Aprendizaje Profundo",
        "Otros: Flujo de Trabajo de Documentos, Modelado de Escenarios"
    ],
    "languages": [
        "Inglés: Avanzado, IELTS",
        "Español: Principiante",
        "Persa: Lengua Materna"
    ],
    "translations": {
        "contact": "Información de Contacto",
        "objective": "Resumen Profesional",
        "experience": "Experiencia",
        "education": "Educación",
        "skills": "Habilidades",
        "languages": "Idiomas"
    }
}
